{
  "Title": "The Functional and Stylistic Peculiarities of Diminutives in the Russian and Czech Languages: A Corpus Study",
  "sections": {
    "Abstract": "A comparative corpus linguistic study of Russian and Czech diminutives is an increasingly important area of research interest because it allows to distinguish the features of two different Slavic cultures, to dispose of cultural barriers and stereotypes. A considerable amount of research has aimed to demonstrate semantic, pragmatic and structural functions of both Russian and Czech diminutives as well as to compare the peculiarities of written and spoken speech (Voyeikova, 2020). Numerous studies have attempted to determine the relationship between genre and contextual conditions for the use of those diminutives (Fil & Rezanova, 2018). However, there is a lack of studies that address the corpus material in a systematic way, touching on several linguistic aspects at once, since current studies mainly carry out comparative analyses of a few lexeme units. The aim of the present study is to identify and characterise the functional and stylistic peculiarities of diminutives in the Russian and Czech languages. Our paper employs corpus linguistics methods, quantitative, qualitative, lexical-semantic comparative and contrastive analysis. The current research might result in a better understanding of the genre-discursive features of the use of Russian and Czech diminutives, features of speech culture, as well as in a systematic presentation of their functional and stylistic specificity.",
    "Keywords": "corpus linguistics, comparative linguistics, functional linguistics, Russian, Czech, diminutives, lexis, semantics, stylistics",
    "Introduction": "A comparative corpus linguistic study of diminutives on the material of Russian and Czech languages is an increasingly important area of research interest and its relevance lies in the fact that these linguistic structures are widely used in everyday speech, literature, and the media. They play an important role in expressing emotions and conveying cultural values. In addition, the study of diminutives can shed light on the cognitive and social processes involved in language acquisition, identity formation, and intercultural communication. By exploring the similarities and differences between Czech and Russian diminutives, researchers can deepen their understanding of the linguistic and cultural diversity of Eastern Europe and enhance their ability to communicate effectively with speakers of these languages. The purpose of the present study is to identify and characterise the functional and stylistic peculiarities of diminutives in the Russian and Czech languages.",
    "Literature Review": "Diminutives of any language, including the Slavic group of languages, have been the focus of linguistic research for a significant amount of time. Due to the fact that over time linguistics has ceased to be solely a humanities science and has merged with some digital technologies, the study of diminutives in Russian and Czech languages is becoming more and more important in the field of corpus linguistics. First of all, the term derives from the Latin word “deminutivus”, meaning “diminutive”. Dictionaries define this term as “a derivative noun or adjective with the meaning of smallness, having an additional expressive-emotional connotation of the meaning of affection, sympathy, pleasing or, on the contrary, pejorative, disdain” (Efremova, 2018, p. 2). Extensive diminutive word formation is a common feature of all Slavic languages and to a large extent distinguishes these languages from other Indo-European and non-Indo-European languages, prompting the ideas about functional-semantic syncretism, the possibility of varying each of the components of syncretistic semantics (quantity, intensity, social significance, pragmatic aspect, etc.), as well as about the relationship between the components of diminutive semantics and the intra-word and external context (Štícha, 1978; Lotko, 2005; Čermák, 2005).\nResearchers note that the Russian language is extremely rich in diminutive forms and explain this by positing the specificity of the Russian language, which is characterised by a great variety of diminutive suffixes that convey different meanings, as well as varying degrees of expressiveness (Bratus, 1969; Olmsted, 1994;  Bagasheva-Koleva, 2016). While in Russian the diminutive form can be formed only from nouns, adjectives and proper names, in Czech it can be derived from with verbs as well, as Prague linguists of the twentieth century shed light on in their works, detailing the word-formation and grammar rules (Mejstřík, 1986; Šlosar, 2003). A considerable amount of research has aimed to demonstrate semantic, pragmatic and structural functions of both Russian and Czech diminutives as well as to compare the peculiarities of written and spoken speech (Voyeikova, 2020). The scientific community has repeatedly raised the issue of inconsistent placement of diminutives in dictionaries due to their intermediate position between form- and word-formation (Káňa, 2016; Jan Rosa, 1983). \nThe semantics of diminutives is not limited only to a diminutive meaning – depending on the preferences of the speaker and the topic of the message, the diminutive is able to update the assessment (positive or negative), emphasizing friendly relations with the object, demonstrating attachment, addressing the inhabitants of \"their\" intimate world (children, elderly people, lovers, pets, etc.), (Ertl, 1983; Fufaeva 2017; Gak, 2000; Vorotnikov, 1988). However, semantics does not explain why this or that social group or gender uses diminutives or in which speech situations diminutives become the most appropriate speech device. Numerous studies have attempted to determine the relationship between genre and contextual conditions for the use of those diminutives (Fil, Rezanova, 2018). The pragmatic character of the choice of the diminutive can be observed, for example, in the context of minimising a request (Dressler, Merlini Barbaresi 2001; Savickienė, Dressler 2007). In addition to softening the request, pragmatic functions include demonstration of friendly, informal relations or helpfulness, desire to please the client or a customer (Schiller, 2007; Gallmann, 2005).\nThe structural features of Slavic diminutives have been unfairly neglected by researchers. Most often we are dealing with the simplification of the declension system: the diminutives usually belong to the most productive inflectional classes of nouns (Savickiene 2003; 2007). In Russian, diminutives allow you to dispose of unproductive female consonant declension (дверь, мышь) and bring the whole system to a simple and phonologically motivated opposition of male consonant declension and female declension on -a (Olmsted, 1994). In contrast, the same cannot be said about Czech diminutives, since the system of form- and word formation of the Czech language is to some extent more diverse, for example, the language strives to preserve the diversity of diminutive forms of all 14 declension models (Kempe et al. 2007; Dressler, Korecky-Kröll, 2015). Another structural difference between Czech diminutives is the developed system of suffixes of varying degrees of intensity (for example, ryba → rybka → rybička), which we will focus below. The diversity of this linguistic category in the Czech language is also confirmed by the fact that many colloquial forms of these words are not recorded in dictionaries, but such linguistic material can be found in the national corpus of the Czech language, ČNK (Giger, 2012).\nIn addition, sufficient attention in the works of Russian and Czech scholars has been paid to the stylistic peculiarities of diminutives, which arise from the culturally embedded traditions and ethnocultural components of each language. Corpus studies have been conducted that clearly illustrated these differences using the example of phraseological units (Kudryavtseva, 2021), musical vocabulary (Eliseeva, 2021), food vocabulary (Kuchař, 2018) and drink vocabulary (Fil, 2018). For example, there is predominantly positive general emotional background of communication in contexts using the Russian unit чаёк and the Czech pivko and a negative background in contexts with the Czech diminutive čajíček. The specificity of the identified variability is explained by the culturally established traditions of drinking tea and enjoying it in Russia and “drinking beer” in the Czech Republic.\nDespite all the advantages of the linguistic affinity of Slavic languages, the problems of translation, which also concern diminutive derivatives, must be not neglected. From this point of view, the greatest difficulty is the declension of nouns, which has been mentioned above, as well as the ethnocultural factor, which subsequently leads us to the problems of linguistic conflictology: the authentic narratives of each language determine differences in the denotative components of the semantics of similar lexemes (Newerkla, 2011; Káňa, 2016). The diminutiveness of varying degrees of intensity, which we have discussed above, is not observed in Russian; this imposes certain difficulties on translation, especially when it comes to ethnocultural components (Roussakova, 2004). There is a lack of studies in that address the corpus material in a systematic way, touching on several linguistic aspects at once, since current studies mainly carry out comparative analyses of a few lexeme units. This work aims to fill in this gap in the literature and to adopt a fresh perspective on the already familiar subject.",
    "Methods": "As material for analysis, I chose multi-genre texts from the national corpus of the Russian language (НКРЯ) and the national corpus of the Czech language (ČNK). The total volume of word uses in the Russian corpus exceeds 2 billion and in the Czech corpus more than 9 billion, which makes these databases valuable resources for various kinds of linguistic analyses, including my study of diminutive forms. \nMy choice of diminutive vocabulary for the following analysis is based on two criteria: the criterion of part of speech and the criterion of ethno-cultural significance. In Russian, diminutive forms can be formed from nouns (карандаш – карандашик, малина-малинка), adjectives (милый – миленький, большой-большенький), adverbs (рядом - рядышком, долго-долгонько) and proper names (Фрунзик Мкртчян). In Czech, the functionality of diminutive forms is more extensive, as the verb is added to the already listed parts of speech (spát - spininkat, spinkat [спать/ possible translation into Russian: спатеньки]). \nBy the criterion of ethno-cultural importance I mean that on the basis of a public consensus of Slavic culture (and on my own modest historical knowledge) I have identified a list of words that are vividly reflected in the culture of the Russian and Czech peoples, which would be simply unfair to neglect in this paper (e.g., čaj, pivo). \nOne of the formal results consists in counting diminutive forms in different contexts in both Russian and Czech, hence the method of quantitative analysis is applied to numerically illustrate the results. I also deal with the semantic method, for the successful application of which I am assisted by Russian and Czech semantic dictionaries.\nBy applying the comparative method, which is suitable for the study of both related and differently structured languages in order to identify common and distinctive properties and features in them, I analyse the above-mentioned groups of diminutives. Since my research belongs to the field of fundamental linguistics, no programming techniques are used; all material is strictly hand-selected using only the feature set of both corpora.",
    "Results": "Preliminary results show that the stratum of diminutive vocabulary is much more extensive in Slavic languages than in other languages of the Indo-European language family. This is a characteristic feature of synthetic languages, which include both Russian and Czech. In these languages, a wide range of expressions of the diminutive category is found at the morphological level with the help of various diminutive-adjective suffixes [Vinogradov, 1986, p. 430].\nAnother preliminary result was the creation or, more precisely, the classification of word-forming affixes to create diminutive forms from different parts of speech in Russian and Czech. A noteworthy example is the use of simple (-ek, -ík, etc.) and complex (-eček, -íček, etc.) suffixes on masculine nouns to form diminutive forms in the Czech language. For the Russian language there is no such distinction in terms of the complexity of affixes, but the variety of word-forming affixes is in no way inferior to the Czech language.\nThe last but not least preliminary result of my research is the finding of semantic differences between the same diminutives in two related languages. To be more precise, the word “tea” in Russian in most contexts has positive semantics, but in Czech it is often negative, which is explained by different national habits (in this case, drinks), this can be considered a manifestation of my ethnocultural criterion.\nThe anticipated results presumably include specific cultural differences between speakers of Russian and Czech; perhaps it will be possible to compile a list or so-called field of the most striking diminutives, reflecting the cultural characteristics of the two Slavic peoples. \nIn addition, specifics will also be introduced through the use of the quantitative method - diminutive word usages will be counted in different contexts of the national corpus of the Russian language, as well as the national corpus of the Czech language: under ideal conditions, an attempt will be made to mathematically analyse the information received in order to formalize the data. This type of research might also be useful in language teaching and learning, as it can help students develop a more nuanced understanding of the language they are studying.",
    "Conclusion": "In general, preliminary results show that the developed formation of diminutives is a characteristic feature of the Slavic languages, in contrast to other languages of the Indo-European language family. In addition, a large number of diminutive word-forming affixes have been identified that require further analysis and classification. Today, the actively developing branch of applied linguistics cannot do without the results of research in the field of fundamental linguistics, so our results, to one degree or another, may be useful for such research.\nIt is premature to say that the aim of the study has been achieved, since there is a need to identify and characterize the functional and stylistic features of diminutive forms in the Russian and Czech languages on a systematic basis using a range of the methods mentioned above. I also have not answered the following questions: What functions besides the main one can a diminutive perform? What semantic or thematic classifications of diminutives can be distinguished? Does diminutive have only diminutive meaning? The research will continue to fill the gap discovered in the scientific field as best as possible.",
    "Word Count": 2025,
    "References": "Bagasheva-Koleva, M.S. (2016). On the category of diminutiveness in English Russian and Bulgarian. World science, 2 (6), 7-10.\nBratus, B. V. (1969) The formation and expressive use of diminutives. Cambridge, 3 (2)\nČermák, F. (2011) Jazyk a jazykověda. Přehled a slovníky. Karolinum\nDressler, W.U., Barbaresi,M. (1994) Morphopragmatics: Diminutives and intensifiers in Italian, German, and other languages. Mouton de Gruyter, 5 (2)\nEfremova, T.F. (2006) Novyi slovar’ russkogo yazyka. Tolkovo-slovoobrazovatel’nyi [New dictionary of the Russian language. Explanatory and derivational]. Moscow: Russkii yazyk\nFil, J.V., Rezanova, Z.I. (2018) Dáme si pivko nebo čajíček? Genre and contextual conditions for the use of diminutives in the Russian and Czech languages. Rusin, 52 (2)\nGallmann, P. (2005) Die Grammatik. Dudenverlag, 13 (4)\nKuchař, J. (1986) Mluvnice češtiny. Praha: Academia, 1 (1)\nLotko, E. (1997) Synchronní konfrontace češtiny a polštiny. Olomouc: Univerzita Palackého\nMejstřík, V. (1986) Tzv. hybridní složeniny a jejich stylová platnost. NŘ, 1 (15)\nNewerkla, S. M. (2011) Čeština v monarchii a středoevropský jazykový areál. Český jazyk a literatura\nOlmsted, H. (1994) Diminutive morphology of Russian children: A simplified subset of nominal declension in language acquisition. \nRoussakova, M.V. (2004) Russian diminutive/hypocoristic adjectives: Between inflection and derivation. \nSavickienė I., Dressler W.U. (2007). The acquisition of diminutives: A cross-linguistic perspective. \nSavickienė, I. (2003) The acquisition of Lithuanian noun morphology. Verlag der Österreichischen Akademie der Wissenschaften\nSavickienė, I. (2007) Form and meaning of diminutives in Lithuanian child language. The acquisition of diminutives: A cross-linguistic perspective. \nSchiller, M. (2007) Pragmatik der Diminutiva, Kosenamen und Kosewörter in der modernen russischen Umgangsliteratursprache. Herbert Utz Verlag\nŠlosar, D. (2005) Minimalizace škod na spisovné češtině. Host, 21 (15)\nŠtícha, F. (2003) Česko-německá srovnávací gramatika. Praha: Argo\nVoeikova, M.D. (2009) Problemy ispol’zovaniya podkorpusa ustnoy razgovornoy rechi (na primere analiza russkikh diminutivov) [Problems of using the subcorpus of oral colloquial speech (the analysis of Russian diminutives)]. \nVoeykova, M. D. (2020) Structural functions of diminutives in modern Russian and the productivity of their use. Issues in Linguistics, 3 (2), 19-25"
  }
}